tap "microsoft/mssql-release"
brew "argo"
brew "chrome-cli"
brew "cloud-sql-proxy"
brew "cloudflared"
brew "cocoapods"
brew "fd"
brew "unixodbc"
brew "freetds"
brew "fzf"
brew "gh"
brew "git"
brew "helm"
brew "htop"
brew "kubernetes-cli"
brew "lazygit"
brew "libpq"
brew "neovim"
brew "node"
brew "python@3.13"
brew "python@3.14"
brew "ripgrep"
brew "sqlcmd"
brew "tailscale"
brew "tesseract"
brew "tesseract-lang"
brew "tmux"
brew "watchman"
brew "zsh"
brew "microsoft/mssql-release/msodbcsql18", link: false
cask "alfred"
cask "android-platform-tools"
cask "android-studio"
cask "antigravity"
cask "chatgpt"
cask "claude"
cask "datagrip"
cask "discord"
cask "docker-desktop"
cask "expo-orbit"
cask "figma"
cask "font-d2coding"
cask "font-d2coding-nerd-font"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "karabiner-elements"
cask "miniconda"
cask "mysqlworkbench"
cask "ngrok"
cask "notion"
cask "onedrive"
cask "pgadmin4"
cask "postman"
cask "rectangle"
cask "shottr"
cask "slack"
cask "spotify"
cask "telegram"
cask "utm"
cask "virtualbox"
cask "visual-studio-code"
cask "vnc-viewer"
cask "wezterm"
cask "zoom"
cask "zulu@17"
vscode "alefragnani.project-manager"
vscode "almenon.arepl"
vscode "anseki.vscode-color"
vscode "anthropic.claude-code"
vscode "asvetliakov.vscode-neovim"
vscode "batisteo.vscode-django"
vscode "clysto.plantuml"
vscode "codezombiech.gitignore"
vscode "cstrap.python-snippets"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "demystifying-javascript.python-extensions-pack"
vscode "docker.docker"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "equimper.react-native-react-redux"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "felipecaputo.git-project-manager"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.docker-explorer"
vscode "formulahendry.docker-extension-pack"
vscode "fosshaas.fontsize-shortcuts"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "harryhopkinson.vim-theme"
vscode "hbenl.vscode-test-explorer"
vscode "jebbs.plantuml"
vscode "jock.svg"
vscode "jonkwheeler.styled-components-snippets"
vscode "kaih2o.python-resource-monitor"
vscode "kevinrose.vsc-python-indent"
vscode "littlefoxteam.vscode-python-test-adapter"
vscode "mebrahtom.plantumlpreviewer"
vscode "mhutchie.git-graph"
vscode "mintlify.document"
vscode "mohd-akram.vscode-html-format"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "msjsdiag.vscode-react-native"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-mysql"
vscode "mtxr.sqltools-driver-pg"
vscode "naumovs.color-highlight"
vscode "njpwerner.autodocstring"
vscode "njqdev.vscode-python-typehint"
vscode "nucllear.vscode-extension-auto-import"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "qhoekman.language-plantuml"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "saoudrizwan.claude-dev"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "thebarkman.vscode-djaneiro"
vscode "trabpukcip.wolf"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "visualstudioexptteam.vscodeintellicode-completions"
vscode "vscodevim.vim"
vscode "waderyan.gitblame"
vscode "wayou.vscode-todo-highlight"
vscode "well-ar.plantuml"
vscode "wholroyd.jinja"
vscode "xirider.livecode"
vscode "yy0931.vscode-sqlite3-editor"
vscode "yzhang.markdown-all-in-one"
vscode "zardoy.open-ai-suggest"
vscode "ziyasal.vscode-open-in-github"
